ch: 6
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# VIS/IR -> CEM (shallow) -> Conv+C3 ->
# FFM#1 + residual -> downsample ->
# FFM#2 + residual -> downsample ->
# FFM#3 -> detect head
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1 VIS
  - [-2, 1, Multiin, [2]]  # 2 IR

  # Shallow contour enhancement (CEM-like) + local feature extraction
  - [1, 1, Conv, [64, 3, 2]]  # 3 VIS P1/2
  - [-1, 1, C3k2, [64, False, 0.25]]  # 4 VIS CEM-like block
  - [2, 1, Conv, [64, 3, 2]]  # 5 IR P1/2
  - [-1, 1, C3k2, [64, False, 0.25]]  # 6 IR CEM-like block

  - [4, 1, Conv, [128, 3, 2]]  # 7 VIS P2/4
  - [-1, 2, C3k2, [128, False, 0.25]]  # 8
  - [6, 1, Conv, [128, 3, 2]]  # 9 IR P2/4
  - [-1, 2, C3k2, [128, False, 0.25]]  # 10

  - [8, 1, Conv, [256, 3, 2]]  # 11 VIS P3/8
  - [-1, 2, C3k2, [256, False, 0.25]]  # 12 VIS P3 feat
  - [10, 1, Conv, [256, 3, 2]]  # 13 IR P3/8
  - [-1, 2, C3k2, [256, False, 0.25]]  # 14 IR P3 feat

  # FFM #1 at P3, then residual update
  - [[12, 14], 1, FFM, [256, 4, 1.5, 0.0, 0.25, 256, 2]]  # 15 fused P3
  - [[12, 15], 1, FeatureAdd, []]  # 16 VIS + FFM1
  - [[14, 15], 1, FeatureAdd, []]  # 17 IR + FFM1

  - [16, 1, Conv, [512, 3, 2]]  # 18 VIS P4/16
  - [-1, 2, C3k2, [512, False, 0.25]]  # 19 VIS P4 feat
  - [17, 1, Conv, [512, 3, 2]]  # 20 IR P4/16
  - [-1, 2, C3k2, [512, False, 0.25]]  # 21 IR P4 feat

  # FFM #2 at P4, then residual update
  - [[19, 21], 1, FFM, [512, 8, 1.5, 0.0, 0.25, 196, 2]]  # 22 fused P4
  - [[19, 22], 1, FeatureAdd, []]  # 23 VIS + FFM2
  - [[21, 22], 1, FeatureAdd, []]  # 24 IR + FFM2

  - [23, 1, Conv, [1024, 3, 2]]  # 25 VIS P5/32
  - [-1, 2, A2C2f, [1024, True, 1]]  # 26 VIS P5 feat
  - [24, 1, Conv, [1024, 3, 2]]  # 27 IR P5/32
  - [-1, 2, A2C2f, [1024, True, 1]]  # 28 IR P5 feat

  # FFM #3 at P5
  - [[26, 28], 1, FFM, [1024, 8, 1.0, 0.0, 0.25, 144, 2]]  # 29 fused P5

head:
  # Top-down path
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 30 P5->P4
  - [[-1, 22], 1, Concat, [1]]  # 31
  - [-1, 2, A2C2f, [512, False, -1]]  # 32 refined P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 33 P4->P3
  - [[-1, 15], 1, Concat, [1]]  # 34
  - [-1, 2, A2C2f, [256, False, -1]]  # 35 refined P3

  # Bottom-up path
  - [-1, 1, Conv, [256, 3, 2]]  # 36 P3->P4
  - [[-1, 32], 1, Concat, [1]]  # 37
  - [-1, 2, A2C2f, [512, False, -1]]  # 38 refined P4 out

  - [-1, 1, Conv, [512, 3, 2]]  # 39 P4->P5
  - [[-1, 29], 1, Concat, [1]]  # 40
  - [-1, 2, C3k2, [1024, True]]  # 41 refined P5 out

  - [[35, 38, 41], 1, Detect, [nc]]  # 42 Detect(P3, P4, P5)
