ch: 6
nc: 1 # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1 VIS
  - [-2, 1, Multiin, [2]]  # 2 IR
  - [1, 1, Conv, [64, 3, 2]]  # 3 VIS P1/2
  - [-1, 1, C3k2, [64, False, 0.25]]  # 4 VIS
  - [2, 1, Conv, [64, 3, 2]]  # 5 IR P1/2
  - [-1, 1, C3k2, [64, False, 0.25]]  # 6 IR
  - [4, 1, Conv, [128, 3, 2]]  # 7 VIS P2/4
  - [-1, 2, C3k2, [128, False, 0.25]]  # 8
  - [6, 1, Conv, [128, 3, 2]]  # 9 IR P2/4
  - [-1, 2, C3k2, [128, False, 0.25]]  # 10
  - [8, 1, Conv, [256, 3, 2]]  # 11 VIS P3/8
  - [-1, 2, C3k2, [256, False, 0.25]]  # 12 VIS P3
  - [10, 1, Conv, [256, 3, 2]]  # 13 IR P3/8
  - [-1, 2, C3k2, [256, False, 0.25]]  # 14 IR P3
  - [[12, 14], 1, CLPFRes, [256, 0.25, 0.25, 16, 2, 1.0]]  # 15 fused P3
  - [[12, 15], 1, FeatureAdd, []]  # 16
  - [[14, 15], 1, FeatureAdd, []]  # 17
  - [16, 1, Conv, [512, 3, 2]]  # 18 VIS P4
  - [-1, 2, C3k2, [512, False, 0.25]]  # 19
  - [17, 1, Conv, [512, 3, 2]]  # 20 IR P4
  - [-1, 2, C3k2, [512, False, 0.25]]  # 21
  - [[19, 21], 1, CLPFRes, [512, 0.25, 0.25, 12, 2, 1.0]]  # 22 fused P4
  - [[19, 22], 1, FeatureAdd, []]  # 23
  - [[21, 22], 1, FeatureAdd, []]  # 24
  - [23, 1, Conv, [1024, 3, 2]]  # 25 VIS P5
  - [-1, 2, A2C2f, [1024, True, 1]]  # 26
  - [24, 1, Conv, [1024, 3, 2]]  # 27 IR P5
  - [-1, 2, A2C2f, [1024, True, 1]]  # 28
  - [[26, 28], 1, CLPFRes, [1024, 0.125, 0.25, 8, 2, 1.0]]  # 29 fused P5

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 30
  - [[-1, 22], 1, Concat, [1]]  # 31
  - [-1, 2, A2C2f, [512, False, -1]]  # 32
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 33
  - [[-1, 15], 1, Concat, [1]]  # 34
  - [-1, 2, A2C2f, [256, False, -1]]  # 35
  - [-1, 1, Conv, [256, 3, 2]]  # 36
  - [[-1, 32], 1, Concat, [1]]  # 37
  - [-1, 2, A2C2f, [512, False, -1]]  # 38
  - [-1, 1, Conv, [512, 3, 2]]  # 39
  - [[-1, 29], 1, Concat, [1]]  # 40
  - [-1, 2, C3k2, [1024, True]]  # 41
  - [[35, 38, 41], 1, Detect, [nc]]  # Detect(P3, P4, P5)
